01  WS-AREA.         
    05  WS-COUNT PIC 9(5) VALUE 0. 
    05  WS-TABLE OCCURS 100 TIMES. 
       10 WS-VALUE PIC 9(3). 
       10 WS-FLAG PIC X. 

PROCEDURE DIVISION. 
    PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 100 
       MOVE 100 TO WS-COUNT 
       ADD 1 TO WS-VALUE(WS-INDEX) 
       IF WS-VALUE(WS-INDEX) > 100 THEN MOVE 'Y' TO WS-FLAG(WS-INDEX) 
    END-PERFORM.